Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Note that this does not add to the instances current speed and direction (for that you would use motion_add()) but rather forces it to the new settings.
zh_cn: 注意，这不会添加到实例的当前速度和方向(为此您将使用motion_add())，而是强制它到新的设置。

source: Note that this does not remove the layer, only the background from it, and if the background is one that has been added in the room editor, then the next time you leave the room and then return, the background will be recreated again.
zh_cn: 注意，这不会删除层，只会删除层中的背景，如果背景是在房间编辑器中添加的，那么下次您离开房间然后返回时，将会再次创建背景。

source: Note that this does not remove the layer, only the sprite from it, and if the sprite is one that has been added in the room editor, then the next time you leave the room and then return, the sprite will be recreated again.
zh_cn: 注意，这并不会移除该层，只会移除其中的精灵，如果精灵是添加在房间编辑器中的精灵，那么当你下次离开房间并返回时，精灵将再次被重新创建。

source: Note that this does not remove the layer, only the tile map from it, and if the tile map is one that has been added in the room editor, then the next time you leave the room and then return, the tile map will be recreated again.
zh_cn: 注意，这并没有删除该层，只是从其中删除了tile map，如果tile map是在房间编辑器中添加的，那么下次您离开房间并返回时，将再次重新创建tile map。

source: Note that this does not start the time line - for that use the variable timeline_running.
zh_cn: 注意，这并没有开始时间线-为此使用变量timeline_running。

source: Note that this doesn't just prevent instances drawing to the screen, it suppresses the draw event completely meaning that care should be taken since any game logic that is present in that event will not be run either.
zh_cn: 注意，这不仅仅是阻止实例绘制到屏幕上，它还完全抑制了绘制事件，这意味着应该小心，因为在该事件中出现的任何游戏逻辑也不会运行。

source: Note that this file is temporary and read only, and as such it will be removed from memory the moment it is closed.
zh_cn: 注意，此文件是临时的且只读的，因此它将在关闭时从内存中删除。

source: Note that this function can also take negative values too, in which case shader textures will be sharper over a greater distance the lower the value.
zh_cn: 注意，此函数也可以取负值，在这种情况下，值越低，着色器纹理在越远的距离上越清晰。

source: Note that this function can only be used on rooms other than the current room, and is designed so that you can add/remove layers and layer elements to rooms other than the room that is currently running.
zh_cn: 注意，此函数只能在当前房间以外的房间上使用，它的设计目的是为了向当前运行的房间以外的房间添加/删除层和层元素。

source: Note that this function can take a variable number of arguments with only the x/y position and width/height arguments being obligatory.
zh_cn: 注意，此函数可以接受可变数量的参数，只有x/y位置和宽度/高度参数是必需的。

source: Note that this function can take negative values too, in which case rendered textures will be sharper over a greater distance the lower the value.
zh_cn: 注意，此函数也可以取负值，在这种情况下，越远的距离渲染的纹理越清晰。

source: Note that this function does not remove any particles currently visible in the room from the screen, for that you should be using part_particles_clear().
zh_cn: 注意，此函数不会从屏幕上删除房间中当前可见的任何粒子，因此应该使用part_particles_clear()。

source: Note that this function is asynchronous, generating an Asynchronous Networking event of the type network_type_non_blocking_connect.
zh_cn: 注意，此函数是异步的，生成类型为network_type_non_blocking_connect的异步网络事件。

source: Note that this function is designed for resizing an array down to a smaller length as you can resize up by simply setting a new index in the array.
zh_cn: 注意，此函数设计用于将数组大小调整到更小的长度，因为您可以通过简单地在数组中设置一个新索引来调整大小。

source: Note that this function is for use with the HTML5 module only.
zh_cn: 注意，此函数仅用于HTML5模块。

source: Note that this function is generally for use with cameras created using camera_create(), but it can also be used on those created in the room editor (or with camera_create_view()) - in which case the returned matrix will only be valid after the given camera is used in a view port for the first time.
zh_cn: 注意，此函数通常用于使用camera_create()创建的相机，但它也可以用于在房间编辑器(或使用camera_create_view())中创建的相机，在这种情况下，返回的矩阵仅在给定相机第一次在视图端口中使用后才有效。

source: Note that this function is only valid for cameras created using camera_create_view() or for those added in the room editor.
zh_cn: 注意，此函数仅对使用camera_create_view()创建的相机或在房间编辑器中添加的相机有效。

source: Note that this function is specifically designed for use with backgrounds that have been added in the IDE, as if you add a background to a layer through code using the function layer_background_create(), then it will return the unique ID for the background element added.
zh_cn: 注意，此函数是专门为在IDE中添加的背景而设计的，就像您通过使用layer_background_create()函数的代码向层添加背景一样，那么它将返回添加的背景元素的唯一ID。

source: Note that this function is specifically designed for use with tile maps that have been added in the IDE, as if you add a tile map to a layer through code using the function layer_tilemap_create(), then it will return the unique ID for the tile map element added.
zh_cn: 注意，此函数是专门设计用于已添加到IDE中的tilemap的，就像您通过使用layer_tilemap_create()函数的代码将tilemap添加到一个层中，那么它将返回添加的tilemap元素的唯一ID。

source: Note that this function may not correctly detect the orientation of the device when used in the HTML5 target module.
zh_cn: 注意，在HTML5目标模块中使用时，此函数可能无法正确检测设备的方向。

source: Note that this function on prepares the fixture to accept the points required to make the chain, and these should be added after calling this function using physics_fixture_add_point(), much as you would when building a polygon fixture.
zh_cn: 注意，上的此函数准备夹具以接受制作链所需的点，这些点应在使用physics_fixture_add_point()调用此函数后添加，就像构建多边形夹具一样。

source: Note that this function will affect the check, pressed and released states for analogue buttons, but will not affect the value returned by the function gamepad_button_check(), which will always return the raw value for the button.
zh_cn: 注意，此函数将影响模拟按钮的检查、按下和释放状态，但不会影响函数gamepad_button_check()返回的值，此函数将始终返回按钮的原始值。

source: Note that this function will be affected by the time zone set (default is local time) which you can change using the date_set_timezone() function.
zh_cn: 注意，此函数将受时区设置的影响(默认为本地时间)，您可以使用date_set_timezone()函数更改该设置。

source: Note that this function will have no visible effect if the path has not been set to smooth in the path editor or using the function path_set_kind().
zh_cn: 注意，如果没有在路径编辑器中或使用函数path_set_kind()将路径设置为平滑，此函数将没有可见效果。

source: Note that this function will not recognise or take into consideration rooms that have been added dynamically using room_add() or room_duplicate().
zh_cn: 注意，此函数不会识别或考虑使用room_add()或room_duplicate()动态添加的房间。

source: Note that this function will only consider a valid datetime as being after 1/1/1970 and anything before that will return false, so the earliest you can check would be:
zh_cn: 注意，此函数只会将1970年1月1日之后视为有效的日期时间，在此之前的任何日期都将返回false，因此您可以检查的最早日期是:

source: Note that this function will only trigger once for the button the first time it is pressed.
zh_cn: 注意，此函数只会在按钮第一次被按下时触发一次。

source: Note that this function will only trigger once for the button the moment it has been released.
zh_cn: 注意，此函数只会在按钮被释放时触发一次。

source: Note that this function will still return true if the sound being checked has previously been paused using the audio_pause_sound() function.
zh_cn: 注意，如果被检查的声音之前已经使用audio_pause_sound()函数暂停过，那么此函数仍然会返回true。

source: Note that this ini file is temporary and will be removed from memory the moment it is closed, losing any information that was stored in it, however the ini_close() function returns a string of the full ini file which can then be saved to a server or to disk.
zh_cn: 注意，这个ini文件是临时的，当它被关闭时将从内存中删除，并丢失存储在其中的任何信息，但是ini_close()函数返回完整ini文件的字符串，然后可以保存到服务器或磁盘。

source: Note that this is a global setting that will affect all axis of all joysticks connected to the device slot specified.
zh_cn: 注意，这是一个全局设置，将影响连接到指定设备插槽的所有操纵杆的所有轴。

source: Note that this is dependent on the layer visibility, and even if the background element is flagged as visible, it will not be drawn if the layer it is on is flagged as not visible.
zh_cn: 注意，这取决于图层的可见性，即使背景元素被标记为可见，如果它所在的图层被标记为不可见，它也不会被绘制。

source: Note that this is enabled by default.
zh_cn: 注意，这是默认启用的。

source: Note that this is generally only for use with legacy projects from previous version of GameMaker where you could have draw depths higher or lower than the permitted layer range.
zh_cn: 注意，这通常只用于GameMaker上一个版本的遗留项目，在这些项目中，你可以绘制高于或低于允许的层范围的深度。

source: Note that this is not necessarily the same as the OS of the device running it, since - for example - your game could be running on an Amazon Fire OS, but will have been built for the Android platform (in which case os_type will be os_android).
zh_cn: 注意，这并不一定与运行它的设备的操作系统相同，因为——例如——你的游戏可以运行在Amazon Fire操作系统上，但将为Android平台构建(在这种情况下，os_type将为os_android)。

source: Note that this is not the actual running speed FPS value (for that use the fps_real variable) but rather the number of game frames (FPS) that the game will attempt to maintain each second, or the length of each game frame in microseconds that the game will try to maintain (MPF).
zh_cn: 注意，这不是实际的运行速度FPS值(使用fps_real变量)，而是游戏每秒钟将试图维持的游戏帧数(FPS)，或游戏将试图维持的每个游戏帧的长度(MPF)。

source: Note that this is not the same as checking if two arrays are the same using ==, which will not check to see if the two arrays hold equivalent values, but only to see if the arrays are referencing the same initial array.
zh_cn: 注意，这与使用==检查两个数组是否相同不同，使用==不会检查两个数组是否拥有等价的值，而只是检查数组是否引用了相同的初始数组。

source: Note that this is only applicable when the sequence is not set to loop or ping-pong in the playback mode.
zh_cn: 注意，这只适用于在播放模式中序列没有被设置为循环或乒乓时。

source: Note that this is the default behaviour, but you can change this by changing the type of comparison used for z-buffer testing (see the function gpu_set_zfunc().
zh_cn: 注意，这是默认行为，但您可以通过更改用于z-buffer测试的比较类型来改变这一点(参见函数gpu_set_zfunc())。

source: Note that this return value is not affected by whether the layer the element is on is visible or not.
zh_cn: 注意，这个返回值不受元素所在的层是否可见的影响。

source: Note that this value only affects the sending and receiving of data, and should you wish to change the connection timeout value then you should be using the function network_set_config().
zh_cn: 注意，这个值只影响数据的发送和接收，如果您希望更改连接超时值，那么应该使用函数network_set_config()。

source: Note that this variable will not recognise or take into consideration rooms that have been added dynamically using room_add() or room_duplicate().
zh_cn: 注意，该变量不会识别或考虑使用room_add()或room_duplicate()动态添加的房间。

source: Note that this variable will only give you the number of instances at the start of the step, so any changes to the instances in the room made after the step has started will not be taken into consideration.
zh_cn: 注意，这个变量只会在步骤开始时给出实例的数量，因此在步骤启动后对房间中实例的任何更改都不会被考虑在内。

source: Note that this will have no effect on fonts that have been added before the function was called, and the function only needs to be called once when the font is added, and not every draw/step that the font is being used.
zh_cn: 注意，这对在调用此函数之前添加的字体没有影响，在添加字体时只需要调用此函数一次，而不是在使用该字体的每一幅画/步骤中都需要调用此函数。

source: Note that this will neither crop nor stretch the contents of the surface, but rather it destroys the current surface and recreates it with the same handle (surface_id) with the new dimensions, meaning that it will need to be cleared and drawn to again (unless it is the application_surface in which case GameMaker will do this automatically).
zh_cn: 注意，这既不会裁剪也不会拉伸表面的内容，而是会破坏当前表面，并使用具有新维度的相同句柄(surface_id)重新创建它，这意味着它将需要被清除并再次绘制到(除非它是application_surface，在这种情况下GameMaker将自动执行此操作)。

source: Note that this will not return any alpha values, for that you should use draw_getpixel_ext().
zh_cn: 注意，这不会返回任何透明度(Alpha)值，因为您应该使用draw_getpixel_ext()。

source: Note that this will simply draw the tilemap at the specified point, using the layer depth of the instance that is calling the function.
zh_cn: 注意，这将只是在指定点绘制tilemap，使用调用此函数的实例的图层深度。

source: Note that to see this effect, you must first have enabled AA using the function draw_enable_swf_aa().
zh_cn: 注意，要看到这种效果，您必须首先使用函数 draw_enable_swf_aa() 启用 AA。

source: Note that trying to parse an invalid value (ie: not a string) will throw an exception error.
zh_cn: 注意，试图解析无效值(即:不是字符串)将抛出异常错误。

source: Note that using code to work with layers means that you can assign different element types to the same layer - so you can have sprite assets along with instances, for example - in which case you can then use the function layer_get_element_type() to get the type of element the ID relates to.
zh_cn: 注意，使用代码处理层意味着您可以将不同的元素类型分配到同一层—因此您可以将精灵资源与实例一起使用—在这种情况下，您可以使用函数layer_get_element_type()来获取ID相关的元素类型。

source: Note that we are using x/y cell positions based on the size of the tile map grid and not as a position in the room, so "cell_x" is a value from 0 to tile map width, and "cell_y" is a value from 0 to tile map height.
zh_cn: 注意，我们使用的x/y单元格位置是基于瓦片地图网格的大小，而不是作为房间中的位置，因此"cell_x"是一个从0到瓦片地图宽度的值，"cell_y"是一个从0到瓦片地图高度的值。

source: Note that what happens in the next step after calling this function will depend on what is being checked and the platform it is being checked on.
zh_cn: 注意，调用此函数后的下一步中发生的事情将取决于正在检查的内容和正在检查的平台。

source: Note that when creating sequence objects in this way you should remove them again by calling the function sequence_destroy() when they are no longer required, otherwise you will have a memory leak which can slow down and eventually crash your game.
zh_cn: 注意，当以这种方式创建序列对象时，您应该在不再需要它们时通过调用函数sequence_destroy()再次删除它们，否则您将会遇到内存泄漏，这会降低速度并最终使您的游戏崩溃。

source: Note that when dealing with priority, the higher the number the higher the priority, such that a sound with priority 100 will be favoured over a sound with priority 1.
zh_cn: 注意，当处理优先级时，数字越高优先级越高，例如优先级为100的声音将优先于优先级为1的声音。

source: Note that when no instances are on the same depth then this temporary layer will be removed from memory (unlike regular layers which will remain even if they have nothing on them).
zh_cn: 注意，当没有实例在相同的深度上时，这个临时层将从内存中删除(不像常规层，即使它们上面没有任何东西也会保留)。

source: Note that when set to "use-credentials" you no longer need to give an absolute path to the sprite being loaded, but instead would give a relative path (as shown in the example below).
zh_cn: 注意，当设置为"use-credentials"时，你不再需要提供被加载精灵的绝对路径，而是提供一个相对路径(如下例所示)。

source: Note that when used with the keyboard_check* functions, the input string can only be one character in length and can only be a number from 0 to 9 or a capitalised Roman character from A to Z.
zh_cn: 注意，当与keyboard_check*函数一起使用时，输入字符串的长度只能是一个字符，并且只能是从0到9的数字或从A到z的大写罗马字符。

source: Note that when using the on-screen Virtual Keyboard, only this variable will be updated with the keyboard input.
zh_cn: 注意，当使用屏幕虚拟键盘时，只有这个变量会随着键盘输入而更新。

source: Note that when you create a sync group, you will need to free the memory and sounds associated with it when not in use using the audio_destroy_sync_group() function - for example, in the Room End or Destroy events.
zh_cn: 注意，在创建同步组时，需要在不使用时使用audio_destroy_sync_group()函数释放与其相关的内存和声音—例如，在Room End或Destroy事件中。

source: Note that you can also send a buffer (see the section on Buffers for more details), in which case the last argument would be the "handle" of the buffer to send.
zh_cn: 注意，您也可以发送一个缓冲区(有关更多细节，请参阅缓冲区一节)，在这种情况下，最后一个参数将是要发送的缓冲区的"句柄"。

source: Note that you can assign a value of -1 as the new sprite index and no sprite will be shown, although the element will still exist and can still be changed again later.
zh_cn: 注意，你可以指定一个值-1作为新的精灵索引，但不会显示任何精灵，尽管元素仍然存在，并可以在以后再次更改。

source: Note that you can have as many as you require (note that more arguments will mean that the function will be slower to parse).
zh_cn: 注意，您可以有您需要的任意数量的参数(注意，更多的参数将意味着函数解析会更慢)。

source: Note that you can use the function audio_get_recorder_info() to get information on each device connected.
zh_cn: 注意，您可以使用函数audio_get_recorder_info()来获取每个连接设备的信息。

source: Note that you cannot copy to a game resource.
zh_cn: 注意，您不能复制到游戏资源。

source: Note that you cannot destroy any animation curves created in the asset browser, only those created at runtime.
zh_cn: 注意，您不能破坏在资源浏览器中创建的任何动画曲线，只能破坏在运行时创建的动画曲线。

source: Note that you likely want to confirm the orientation is as desired before locking.
zh_cn: 注意，您可能希望在锁定之前确认方向是否符合要求。

source: Note that you must have created the particle system and the particle type previously for this function to be used.
zh_cn: 注意，要使用此函数，您必须已经创建了粒子系统和粒子类型。

source: Note this variable is deprecated in favour of the function os_get_info() which returns more accurate information on the device running the game.
zh_cn: 注意这个变量已被弃用，取而代之的是函数os_get_info()，它返回关于运行游戏的设备的更准确的信息。

source: Note too that activation is not instantaneous, and an instance that has been activated in this way will not be considered to be active until the end of the event in which the function was called.
zh_cn: 还要注意，激活不是瞬时的，以这种方式激活的实例在调用函数的事件结束之前不会被认为是活动的。

source: Note too that deactivation is not instantaneous, and an instance that has been deactivated in this way will not be considered to be inactive until the end of the event in which the function was called.
zh_cn: 还要注意，停用不是瞬时的，以这种方式去激活的实例在调用函数的事件结束之前不会被认为是不活动的。

source: Note too that the friction is applied to positive and negative speeds equally with the net result always being that the object has a speed of 0 after a given time.
zh_cn: 还要注意的是，摩擦力同样作用于正速度和负速度，最终的结果总是物体在给定时间后的速度为0。

source: Note too that the zip must be either part of the game bundle (ie: an Included File) or have been downloaded to the storage area using http_get_file().
zh_cn: 还要注意，zip必须是游戏包的一部分(即:一个包含的文件)，或者已经使用http_get_file()下载到存储区域。

source: Note, that this is not a string, but rather the asset name which holds the unique index for each script (as it would appear in the IDE) or the script function name variable, as defined within the script asset (note that this will not work for method variables).
zh_cn: 注意，这不是一个字符串，而是保存每个脚本的惟一索引的资源名称(就像它在IDE中出现的那样)或脚本函数名变量(如脚本资源中定义的那样)(注意，这不适用于方法变量)。

source: Now, it should be noted that for this to work, the instance running the code must have a valid collision mask (either for the sprite itself, or through the mask_index) and it will only register collisions with those solid flagged instances that also have a valid mask.
zh_cn: 现在，应该注意的是，为了实现这一点，运行代码的实例必须有一个有效的碰撞掩码(或者是对于sprite本身，或者是通过mask_index ),并且它将只注册与那些也有有效掩码的实体标志实例的碰撞。

source: Now, normally you work in x/y room coordinates, and not in MP grid cell coordinates.
zh_cn: 现在，通常您在x/y房间坐标中工作，而不是在MP网格单元坐标中工作。

source: Now, the default for GameMaker is that the game window (or background canvas) is the same size as the room, however when you activate view ports and cameras, this behaviour changes and the total size of the bounding box for all view ports is used.
zh_cn: 现在，GameMaker的默认设置是游戏窗口(或背景画布)与房间大小相同，但是当您激活视口和相机时，这种行为会发生变化，所有视口的边界框的总大小都会被使用。

source: Number of available audio channels (default is 128).
zh_cn: 可用音频通道的数量(默认为128)。

source: Number of frames to use for local input frame delay
zh_cn: 用于本地输入帧延迟的帧数

source: Number of horizontal cells that the mp_grid will contain
zh_cn: mp_grid将包含的水平单元格的数量

source: Number of ms of latency to add
zh_cn: 要添加的延迟毫秒数

source: Number of vertical cells that the mp_grid will contain
zh_cn: mp_grid将包含的垂直单元格的数量

source: OPTIONAL!
zh_cn: 可选！

source: Object index, or instance id, of the instances to be added into the mp_grid
zh_cn: 要使用的mp_grid的索引

source: Older iPhone/iPod Touch (480 x 320 screen) or Android phone
zh_cn: 老式iPhone/iPod Touch (480 x 320屏幕)或Android手机

source: On Android you will need the the ID of the achievement as a string (this is the unique achievement ID that got assigned when you set up the achievement), while on all other platforms you supply the achievement name as a string, and then you give the percentage that you have completed towards getting the achievement (0 - None, 100 - Completed).
zh_cn: 在Android上，你需要一个字符串形式的成就id(这是你设置成就时分配的唯一成就ID)，而在所有其他平台上，你以字符串形式提供成就名称，然后给出你已完成成就的百分比(0 -无，100 -已完成)。

source: On Android, you send the ID of the achievement as a string (this is the unique achievement ID that got assigned when you set up the achievement), while on all other platforms you supply the defined achievement name as a string, and then you give the actual achievement value to increment by.
zh_cn: 在Android上，你将成就ID作为字符串发送(这是当你设置成就时所分配的唯一成就ID)，而在所有其他平台上，你将以字符串的形式提供已定义的成就名称，然后你将给出实际的成就值。

source: On Android, you send the ID of the score table as a string (this is the unique leaderboard ID that got assigned when you set up the leaderboard), while on all other platforms you supply the defined leaderboard name as a string, and then you give the actual score value.
zh_cn: 在Android平台上，你需要以字符串形式发送积分表ID(这是当你设置积分排行榜时所分配的唯一积分ID)，而在其他平台上，你需要以字符串形式提供已定义的积分排行榜名称，然后再给出实际的积分值。

source: On Opera GX and HTML5, the audio context status can change at any time depending on user input, the browser being used, and its version, so this function can be used to check and see if audio can be played or not.
zh_cn: 在Opera GX和HTML5上，音频上下文状态可以根据用户输入、正在使用的浏览器及其版本随时改变，因此此函数可以用于检查和查看音频是否可以播放。

source: On adding a font using that function, GameMaker will create a texture page cache of the required glyphs up to the size defined by this variable.
zh_cn: 在使用此函数添加字体时，GameMaker将创建所需字形的纹理页面缓存，其大小由该变量定义。

source: On all platforms, this function will return true immediately after Game Start when the audio engine is initialised, except on the Opera GX and HTML5 targets.
zh_cn: 在所有平台上，当音频引擎初始化时，此函数将在游戏开始后立即返回true，除了在Opera GX和HTML5目标上。

source: On how many entries should the function be executed.
zh_cn: 函数应该执行多少个条目。

source: On the HTML5 target, we use the HTML5 Local Storage API for client side saving, and the functions does not support binary file operations, so assumes you are copying a text file.
zh_cn: 在HTML5目标上，我们使用HTML5本地存储API进行客户端保存，并且函数不支持二进制文件操作，所以假设您正在复制一个文本文件。

source: Once called, the slot index will need to be remapped using the gamepad_test_mapping() function if you want to be able to be able to use the gamepad constants to detect input correctly (direct input can always be retrieved using the gamepad_axis/button/hat_count() and gamepad_axis/button/hat_value() functions together).
zh_cn: 一旦被调用，如果您希望能够使用gamepad常量来正确检测输入，就需要使用gamepad_test_mapping()函数重新映射插槽索引(直接输入总是可以使用gamepad_axis/button/hat_count()和gamepad_axis/button/hat_value()函数一起检索)。

source: Once paired, particles do not change "partners" , and the farther an external force pulls them from one another, the greater the power with which they will collide when that external force is removed.
zh_cn: 一旦配对，粒子不会改变"伙伴"，外力将它们拉得越远，当外力移除时，它们碰撞的力量就越大。

source: Once the fixture has been bound to all the instances that you need, it can be deleted if no longer necessary and the instances with that fixtures properties will not be affected and maintain those properties.
zh_cn: 一旦夹具被绑定到您需要的所有实例，如果不再需要，可以将其删除，具有该夹具属性的实例将不会受到影响并保持这些属性。

source: Once the tension is broken, the particles bounce as if they were elastic, but also continue to attract each other.
zh_cn: 一旦张力被打破，粒子就像有弹性一样反弹，但也会继续相互吸引。

source: Once the user has input the details and pressed the "Okay" button, an asynchronous User Interaction event is triggered which, for the duration of that event only, will have a DS map stored in the variable async_load.
zh_cn: 一旦用户输入了详细信息并按下了"ok"按钮，就会触发一个异步用户交互事件，在该事件持续期间，该事件的DS map将存储在变量async_load中。

source: Once the user has pressed the "Okay" button, an asynchronous Dialog event is triggered which, for the duration of that event only, will have a ds_map stored in the variable async_load.
zh_cn: 一旦用户按下"ok"按钮，一个异步对话框事件被触发，在该事件持续期间，该事件将有一个ds_map存储在变量async_load中。

source: Once the user has typed out their string and pressed the "Okay" button, an asynchronous Dialog event is triggered which, for the duration of that event only, will have a DS map stored in the variable async_load.
zh_cn: 一旦用户输入字符串并按下"ok"按钮，就会触发一个异步对话框事件，在该事件持续期间，该事件的DS map将存储在变量async_load中。

source: Once two instances with physics representations have been bound by a joint, this can be deleted again at any time.
zh_cn: 一旦具有物理表示的两个实例被关节绑定，就可以随时再次删除。

source: Once we have defined our fixture it has to be bound to an instance.
zh_cn: 一旦我们定义了我们的夹具，它必须被绑定到一个实例。
